OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Middlewares/SubGHz_Phy/stm32_radio_driver/radio_driver.c
/*
 * @brief SUBGHZ_HandleTypeDef structure that contains
  *       the configuration information for SPI module
 */
SUBGHZ_HandleTypeDef hsubghz;
/*
 * Private functions prototypes
 */

/*!
 * @brief Holds the internal operating mode of the radio
 */
RadioOperatingModes_t OperatingMode;
   
void (*RadioOnDioIrqCb) ( RadioIrqMasks_t radioIrq );

/*
 * Public functions 
 */

uint32_t SUBGRF_GetRadioWakeUpTime( void )
{
  return ( uint32_t ) BSP_RADIO_GetWakeUpTime();
}

RadioOperatingModes_t SUBGRF_GetOperatingMode( void )
{
  return OperatingMode;
}

int32_t SUBGRF_Init( void (*RadioOnDioIrq) ( RadioIrqMasks_t radioIrq ) )
{
  if ( RadioOnDioIrq!=NULL)
  {
    RadioOnDioIrqCb = RadioOnDioIrq;
  }
  
  TCXO_Workaround(RF_API_STATE_TCXO_ON);
  
  hsubghz.Init.BaudratePrescaler=SUBGHZSPI_BAUDRATEPRESCALER_4;
  
  HAL_SUBGHZ_Init(&hsubghz);
  
  ImageCalibrated = false;

  RadioReset_Workaround();
  
  SUBGRF_SetStandby( STDBY_RC );

  if (1U ==BSP_RADIO_IsTCXO() )
  {
    uint8_t reg = 0x2F;
    
    SUBGRF_SetTcxoMode( TCXO_CTRL_1_8V, 64 * BSP_RADIO_GetWakeUpTime() );// 100 ms
    
    HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_XTA_TRIM, (uint8_t*)&reg , 1);
    
    /*enable calibration for cut1.1 and later*/
    if (LL_DBGMCU_GetRevisionID() !=0x1000)
    {
      CalibrationParams_t calibParam;
      calibParam.Value = 0x7F;
      SUBGRF_Calibrate( calibParam );
    }
  }
  /* Init RF Switch */
  BSP_RADIO_Init();
  
  OperatingMode = MODE_STDBY_RC;
  
  TCXO_Workaround(RF_API_STATE_TCXO_OFF);
    
  return SUBGRF_OK;
}

void SUBGRF_SetPayload( uint8_t *payload, uint8_t size )
{
    HAL_SUBGHZ_WriteBuffer( &hsubghz, 0x00, payload, size );
}

uint8_t SUBGRF_GetPayload( uint8_t *buffer, uint8_t *size,  uint8_t maxSize )
{
    uint8_t offset = 0;

    SUBGRF_GetRxBufferStatus( size, &offset );
    if( *size > maxSize )
    {
        return 1;
    }
    HAL_SUBGHZ_ReadBuffer( &hsubghz, offset, buffer, *size );
    return 0;
}

void SUBGRF_SendPayload( uint8_t *payload, uint8_t size, uint32_t timeout)
{
    SUBGRF_SetPayload( payload, size );
    SUBGRF_SetTx( timeout );
}

void SUBGRF_SetSwitch (uint8_t power, RFState_t rxtx)
{
  BSP_RADIO_Switch_TypeDef state;
  
  if (rxtx == RFSWITCH_TX)
  {
    if (power == RFO_LP)
    {
      state = RADIO_SWITCH_RFO_LP;
    }
    if (power == RFO_HP)
    {
      state = RADIO_SWITCH_RFO_HP;
    }
  }
  else
  {
    if (rxtx == RFSWITCH_RX)
    {
      state = RADIO_SWITCH_RX;
    }
  }
    BSP_RADIO_ConfigRFSwitch(state);
}

uint8_t SUBGRF_SetSyncWord( uint8_t *syncWord )
{
    HAL_SUBGHZ_WriteRegisters( &hsubghz,REG_LR_SYNCWORDBASEADDRESS, syncWord, 8 );
    return 0;
}

void SUBGRF_SetCrcSeed( uint16_t seed )
{
    uint8_t buf[2];

    buf[0] = ( uint8_t )( ( seed >> 8 ) & 0xFF );
    buf[1] = ( uint8_t )( seed & 0xFF );

    switch( SUBGRF_GetPacketType( ) )
    {
        case PACKET_TYPE_GFSK:
            HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_LR_CRCSEEDBASEADDR, buf, 2 );
            break;
        default:
            break;
    }
}

void SUBGRF_SetCrcPolynomial( uint16_t polynomial )
{
    uint8_t buf[2];

    buf[0] = ( uint8_t )( ( polynomial >> 8 ) & 0xFF );
    buf[1] = ( uint8_t )( polynomial & 0xFF );

    switch( SUBGRF_GetPacketType( ) )
    {
        case PACKET_TYPE_GFSK:
            HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_LR_CRCPOLYBASEADDR, buf, 2 );
            break;

        default:
            break;
    }
}

void SUBGRF_SetWhiteningSeed( uint16_t seed )
{
  uint8_t regValue = 0;
  
  switch( SUBGRF_GetPacketType( ) )
  {
  case PACKET_TYPE_GFSK:
    HAL_SUBGHZ_ReadRegisters( &hsubghz, REG_LR_WHITSEEDBASEADDR_MSB, &regValue, 1 );
    regValue = regValue & 0xFE;
    regValue = ( ( seed >> 8 ) & 0x01 ) | regValue;
    HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_LR_WHITSEEDBASEADDR_MSB, (uint8_t*)&regValue, 1 ); // only 1 bit.
    HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_LR_WHITSEEDBASEADDR_LSB, (uint8_t*)&seed, 1);
    break;
    
  default:
    break;
  }
}

uint32_t SUBGRF_GetRandom( void )
{
    uint8_t buf[] = { 0, 0, 0, 0 };

    // Set radio in continuous reception
    SUBGRF_SetRfFrequency( 400e6 );
    
    SUBGRF_SetRx( 0 );

    HAL_Delay( 1 );

    HAL_SUBGHZ_ReadRegisters( &hsubghz, RANDOM_NUMBER_GENERATORBASEADDR, buf, 4 );

    SUBGRF_SetStandby( STDBY_RC );

    return ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
}

void SUBGRF_SetSleep( SleepParams_t sleepConfig )
{
    BSP_RADIO_ConfigRFSwitch(RADIO_SWITCH_OFF); /* switch the antenna OFF by SW */
    
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_SLEEP, &sleepConfig.Value, 1 );
    OperatingMode = MODE_SLEEP;
    
    TCXO_Workaround(RF_API_STATE_TCXO_OFF);
}

void SUBGRF_SetStandby( RadioStandbyModes_t standbyConfig )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_STANDBY, ( uint8_t* )&standbyConfig, 1 );
    if( standbyConfig == STDBY_RC )
    {
        OperatingMode = MODE_STDBY_RC;
    }
    else
    {
        OperatingMode = MODE_STDBY_XOSC;
    }
}

void SUBGRF_SetFs( void )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_FS, 0, 0 );
    OperatingMode = MODE_FS;
}

void SUBGRF_SetTx( uint32_t timeout )
{
    uint8_t buf[3];

    OperatingMode = MODE_TX;

    buf[0] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( timeout & 0xFF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TX, buf, 3 );
}

void SUBGRF_SetRx( uint32_t timeout )
{
    uint8_t buf[3];

    OperatingMode = MODE_RX;
  
    buf[0] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( timeout & 0xFF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_RX, buf, 3 );
    
}

void SUBGRF_SetRxBoosted( uint32_t timeout )
{
    uint8_t buf[3];
    uint8_t reg = 0x97;
    OperatingMode = MODE_RX;

    HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_RX_GAIN, (uint8_t*)&reg, 1 ); // max LNA gain, increase current by ~2mA for around ~3dB in sensivity

    buf[0] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( timeout & 0xFF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_RX, buf, 3 );
}

void SUBGRF_SetRxDutyCycle( uint32_t rxTime, uint32_t sleepTime )
{
    uint8_t buf[6];
    
