OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Middlewares/SubGHz_Phy/stm32_radio_driver/radio_driver.c
    buf[0] = ( uint8_t )( ( rxTime >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( rxTime >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( rxTime & 0xFF );
    buf[3] = ( uint8_t )( ( sleepTime >> 16 ) & 0xFF );
    buf[4] = ( uint8_t )( ( sleepTime >> 8 ) & 0xFF );
    buf[5] = ( uint8_t )( sleepTime & 0xFF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_RXDUTYCYCLE, buf, 6 );
    OperatingMode = MODE_RX_DC;
}

void SUBGRF_SetCad( void )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_CAD, 0, 0 );
    
    OperatingMode = MODE_CAD;
}

void SUBGRF_SetTxContinuousWave( void )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TXCONTINUOUSWAVE, 0, 0 );
}

void SUBGRF_SetTxInfinitePreamble( void )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TXCONTINUOUSPREAMBLE, 0, 0 );
}

void SUBGRF_SetStopRxTimerOnPreambleDetect( bool enable )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_STOPRXTIMERONPREAMBLE, ( uint8_t* )&enable, 1 );
}

void SUBGRF_SetLoRaSymbNumTimeout( uint8_t SymbNum )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_LORASYMBTIMEOUT, &SymbNum, 1 );
}

void SUBGRF_SetRegulatorMode( void )
{
    RadioRegulatorMode_t mode;
    
    if (1U == BSP_RADIO_IsDCDC() )
    {
      mode=USE_DCDC ;
    }
    else
    {
       mode=USE_LDO ;
    }
  
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_REGULATORMODE, ( uint8_t* )&mode, 1 );
}

void SUBGRF_Calibrate( CalibrationParams_t calibParam )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_CALIBRATE, ( uint8_t* )&calibParam, 1 );
}

void SUBGRF_CalibrateImage( uint32_t freq )
{
    uint8_t calFreq[2];

    if( freq > 900000000 )
    {
        calFreq[0] = 0xE1;
        calFreq[1] = 0xE9;
    }
    else if( freq > 850000000 )
    {
        calFreq[0] = 0xD7;
        calFreq[1] = 0xD8;
    }
    else if( freq > 770000000 )
    {
        calFreq[0] = 0xC1;
        calFreq[1] = 0xC5;
    }
    else if( freq > 460000000 )
    {
        calFreq[0] = 0x75;
        calFreq[1] = 0x81;
    }
    else if( freq > 425000000 )
    {
        calFreq[0] = 0x6B;
        calFreq[1] = 0x6F;
    }
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_CALIBRATEIMAGE, calFreq, 2 );
}

void SUBGRF_SetPaConfig( uint8_t paDutyCycle, uint8_t hpMax, uint8_t deviceSel, uint8_t paLut )
{
    uint8_t buf[4];

    buf[0] = paDutyCycle;
    buf[1] = hpMax;
    buf[2] = deviceSel;
    buf[3] = paLut;
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_PACONFIG, buf, 4 );
}

void SUBGRF_SetRxTxFallbackMode( uint8_t fallbackMode )
{
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TXFALLBACKMODE, &fallbackMode, 1 );
}

void SUBGRF_SetDioIrqParams( uint16_t irqMask, uint16_t dio1Mask, uint16_t dio2Mask, uint16_t dio3Mask )
{
    uint8_t buf[8];

    buf[0] = ( uint8_t )( ( irqMask >> 8 ) & 0x00FF );
    buf[1] = ( uint8_t )( irqMask & 0x00FF );
    buf[2] = ( uint8_t )( ( dio1Mask >> 8 ) & 0x00FF );
    buf[3] = ( uint8_t )( dio1Mask & 0x00FF );
    buf[4] = ( uint8_t )( ( dio2Mask >> 8 ) & 0x00FF );
    buf[5] = ( uint8_t )( dio2Mask & 0x00FF );
    buf[6] = ( uint8_t )( ( dio3Mask >> 8 ) & 0x00FF );
    buf[7] = ( uint8_t )( dio3Mask & 0x00FF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_CFG_DIOIRQ, buf, 8 );
}

uint16_t SUBGRF_GetIrqStatus( void )
{
    uint8_t irqStatus[2];

    HAL_SUBGHZ_ExecGetCmd( &hsubghz, RADIO_GET_IRQSTATUS, irqStatus, 2 );
    return ( irqStatus[0] << 8 ) | irqStatus[1];
}

void SUBGRF_SetTcxoMode (RadioTcxoCtrlVoltage_t tcxoVoltage, uint32_t timeout )
{
    uint8_t buf[4];

    buf[0] = tcxoVoltage & 0x07;
    buf[1] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[2] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[3] = ( uint8_t )( timeout & 0xFF );

    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TCXOMODE, buf, 4 );
}

void SUBGRF_SetRfFrequency( uint32_t frequency )
{
    uint8_t buf[4];
    uint32_t chan;
    
    TCXO_Workaround(RF_API_STATE_TCXO_ON);
    
    if( ImageCalibrated == false )
    {
        SUBGRF_CalibrateImage( frequency );
        ImageCalibrated = true;
    }

    //chan = ( uint32_t )( ( double )frequency / ( double )FREQ_STEP );
    SX_FREQ_TO_CHANNEL(chan, frequency);   

    buf[0] = ( uint8_t )( ( chan >> 24 ) & 0xFF );
    buf[1] = ( uint8_t )( ( chan >> 16 ) & 0xFF );
    buf[2] = ( uint8_t )( ( chan >> 8 ) & 0xFF );
    buf[3] = ( uint8_t )( chan & 0xFF );
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_RFFREQUENCY, buf, 4 );
    
    
}

void SUBGRF_SetPacketType( RadioPacketTypes_t packetType )
{
  uint8_t reg = 0x00;
    // Save packet type internally to avoid questioning the radio
    PacketType = packetType;
    
    if( packetType == PACKET_TYPE_GFSK )
    {
        HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_BIT_SYNC, (uint8_t*)&reg, 1 );
    }
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_PACKETTYPE, ( uint8_t* )&packetType, 1 );
}

RadioPacketTypes_t SUBGRF_GetPacketType( void )
{
    return PacketType;
}
uint8_t SUBGRF_SetTxPower(  int8_t power, RadioRampTimes_t rampTime ) 
{
  uint8_t paSelect;
  
  int32_t TxConfig = BSP_RADIO_GetTxConfig();
  
  switch (TxConfig)
  {
    case RADIO_CONF_RFO_LP_HP:
    {
      if (power>15)
      {
        paSelect= RFO_HP;
      }
      else
      {
        paSelect= RFO_LP;
      }
      break;
    }
    case RADIO_CONF_RFO_LP:
    {
      paSelect= RFO_LP;
      break;
    }
    case RADIO_CONF_RFO_HP:
    {
      paSelect= RFO_HP;
      break;
    }
  default:
    break;
  }

  SUBGRF_SetTxParams(  paSelect,  power,  rampTime );
  
  return paSelect;
}
void SUBGRF_SetTxParams( uint8_t paSelect, int8_t power, RadioRampTimes_t rampTime ) 
{
    uint8_t buf[2];
    uint8_t reg;

    if( paSelect == RFO_LP )
    {
        if( power == 15 )
        {
            SUBGRF_SetPaConfig( 0x06, 0x00, 0x01, 0x01 );
        }
        else
        {
            SUBGRF_SetPaConfig( 0x04, 0x00, 0x01, 0x01 );
        }
        if( power >= 14 )
        {
            power = 14;
        }
        else if( power < -3 )
        {
            power = -3;
        }
        reg = 0x18;
        HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_OCP, (uint8_t*)&reg, 1 ); // current max is 80 mA for the whole device
    }
    else // rfo_hp
    {
        SUBGRF_SetPaConfig( 0x04, 0x07, 0x00, 0x01 );
        if( power > 22 )
        {
            power = 22;
        }
        else if( power < -3 )
        {
            power = -3;
        }
        reg = 0x38;
        HAL_SUBGHZ_WriteRegisters( &hsubghz, REG_OCP, (uint8_t*)&reg, 1 ); // current max 160mA for the whole device
    }
    buf[0] = power;
    buf[1] = ( uint8_t )rampTime;
    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_TXPARAMS, buf, 2 );
}



void SUBGRF_SetModulationParams( ModulationParams_t *modulationParams )
{
    uint8_t n;
    uint32_t tempVal = 0;
    uint8_t buf[8] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

    // Check if required configuration corresponds to the stored packet type
    // If not, silently update radio packet type
    if( PacketType != modulationParams->PacketType )
    {
        SUBGRF_SetPacketType( modulationParams->PacketType );
    }

    switch( modulationParams->PacketType )
    {
    case PACKET_TYPE_GFSK:
        n = 8;
        tempVal = ( uint32_t )( 32 * ( ( double )XTAL_FREQ / ( double )modulationParams->Params.Gfsk.BitRate ) );
        buf[0] = ( tempVal >> 16 ) & 0xFF;
        buf[1] = ( tempVal >> 8 ) & 0xFF;
        buf[2] = tempVal & 0xFF;
        buf[3] = modulationParams->Params.Gfsk.ModulationShaping;
        buf[4] = modulationParams->Params.Gfsk.Bandwidth;
        //tempVal = ( uint32_t )( ( double )modulationParams->Params.Gfsk.Fdev / ( double )FREQ_STEP );
        SX_FREQ_TO_CHANNEL(tempVal, modulationParams->Params.Gfsk.Fdev); 
        buf[5] = ( tempVal >> 16 ) & 0xFF;
        buf[6] = ( tempVal >> 8 ) & 0xFF;
        buf[7] = ( tempVal& 0xFF );
        HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_MODULATIONPARAMS, buf, n );
        break;
    case PACKET_TYPE_BPSK:
        n = 4;
        tempVal = ( uint32_t )( 32 * ( ( double )XTAL_FREQ / ( double )modulationParams->Params.Bpsk.BitRate ) );

