OpenAtomFoundation/TobudOS/board/RHF0M0E5_STM32WLE5xx/BSP/Middlewares/SubGHz_Phy/stm32_radio_driver/radio_driver.c
void SUBGRF_WriteRegister( uint16_t addr, uint8_t data )
{
    HAL_SUBGHZ_WriteRegisters( &hsubghz, addr, (uint8_t*)&data, 1 );
}

uint8_t SUBGRF_ReadRegister( uint16_t addr )
{
  uint8_t data;
  HAL_SUBGHZ_ReadRegisters( &hsubghz, addr, &data, 1 );
  return data;
}

void SUBGRF_WriteRegisters( uint16_t addr, uint8_t *buffer, uint8_t size )
{
    HAL_SUBGHZ_WriteRegisters( &hsubghz, addr, buffer, size );
}

void SUBGRF_ReadRegisters( uint16_t addr, uint8_t *buffer, uint8_t size )
{
    HAL_SUBGHZ_ReadRegisters( &hsubghz, addr, buffer, size );
}


/* HAL_SUBGHz Callbacks definitions */ 
void HAL_SUBGHZ_TxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_TX_DONE );
}

void HAL_SUBGHZ_RxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_RX_DONE );
}

void HAL_SUBGHZ_CRCErrorCallback (SUBGHZ_HandleTypeDef *hsubghz)
{
   RadioOnDioIrqCb( IRQ_CRC_ERROR);
}

void HAL_SUBGHZ_CADDoneCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_CAD_DONE);
}

void HAL_SUBGHZ_CADActivityDetectedCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_CAD_ACTIVITY_DETECTED);
}

void HAL_SUBGHZ_RxTxTimeoutCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_RX_TX_TIMEOUT);
}

void HAL_SUBGHZ_HeaderErrorCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_HEADER_ERROR);
}

void HAL_SUBGHZ_PreambleDetectedCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_PREAMBLE_DETECTED);
}

void HAL_SUBGHZ_SyncWordValidCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_SYNCWORD_VALID);
}

void HAL_SUBGHZ_HeaderValidCallback(SUBGHZ_HandleTypeDef *hsubghz)
{
  RadioOnDioIrqCb( IRQ_HEADER_VALID);
}


static void TCXO_Workaround( RF_API_Tcxo_State_t state )
{
  /* Workaround  needed only for cut1.0*/
  uint16_t RevisionID =  LL_DBGMCU_GetRevisionID(); 

  if (1U ==BSP_RADIO_IsTCXO() && (RevisionID==0x1000) )
  {
    switch (state)
    {
    case RF_API_STATE_TCXO_OFF:
        LL_RCC_HSE_Disable();
        
        LL_RCC_HSE_DisableTcxo();
        
        LL_RCC_HSE_DisableBypass();
        
        UTIL_LPM_SetStopMode( LPM_TCXO_WA_Id , UTIL_LPM_ENABLE);
        
        MW_LOG("TCXOFF\n\r");
      break;
      
    case RF_API_STATE_TCXO_ON:
        LL_RCC_HSE_EnableTcxo();
        
        LL_RCC_HSE_EnableBypass();
        
        LL_RCC_HSE_Enable();
        
        UTIL_LPM_SetStopMode( LPM_TCXO_WA_Id , UTIL_LPM_DISABLE);
        
        MW_LOG("TCXON\n\r");
        
        while(LL_RCC_HSE_IsReady() == 0)
        {
        }
      
      break;

    default:
      break;
    }
  }
}

static void RadioReset_Workaround( void )
{
  if ( LL_DBGMCU_GetRevisionID() ==0x1000 )
  {
    uint8_t reg=0;

    HAL_SUBGHZ_ExecSetCmd( &hsubghz, RADIO_SET_SLEEP, &reg, 1 );

    RADIO_DELAY_MS( 2 );
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

